<?xml version="1.0" ?>
<net name="tiny-yolov3-11" version="10">
	<layers>
		<layer id="0" name="image_shape" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 2"/>
			<output>
				<port id="0" names="image_shape" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_1" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 3, 416, 416"/>
			<output>
				<port id="0" names="input_1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="batch_normalization_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="16, 3, 3, 3" size="864"/>
			<output>
				<port id="0" names="conv2d_1/kernel:0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv2d_1" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data_add_10303" type="Const" version="opset1">
			<data element_type="f16" offset="864" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="batch_normalization_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_norm_output_buffer10" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="leaky_re_lu_1/weights1493321402" type="Const" version="opset1">
			<data element_type="f32" offset="896" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="leaky_re_lu_1" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/leaky_re_lu_1/LeakyRelu:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model_1/leaky_re_lu_1/LeakyRelu:0_pooling" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="ceil" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/leaky_re_lu_1/LeakyRelu:0_pooling0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="batch_normalization_2/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="900" shape="32, 16, 3, 3" size="9216"/>
			<output>
				<port id="0" names="conv2d_2/kernel:0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv2d_2" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="data_add_1030610311" type="Const" version="opset1">
			<data element_type="f16" offset="10116" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="batch_normalization_2/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_norm_output_buffer9" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="leaky_re_lu_2/weights1493721339" type="Const" version="opset1">
			<data element_type="f32" offset="896" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="leaky_re_lu_2" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/leaky_re_lu_2/LeakyRelu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model_1/leaky_re_lu_2/LeakyRelu:0_pooling" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="ceil" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/leaky_re_lu_2/LeakyRelu:0_pooling0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="batch_normalization_3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="10180" shape="64, 32, 3, 3" size="36864"/>
			<output>
				<port id="0" names="conv2d_3/kernel:0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="conv2d_3" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_add_1031410319" type="Const" version="opset1">
			<data element_type="f16" offset="47044" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="batch_normalization_3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_norm_output_buffer8" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="leaky_re_lu_3/weights1494520961" type="Const" version="opset1">
			<data element_type="f32" offset="896" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="leaky_re_lu_3" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/leaky_re_lu_3/LeakyRelu:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="model_1/leaky_re_lu_3/LeakyRelu:0_pooling" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="ceil" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/leaky_re_lu_3/LeakyRelu:0_pooling0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="batch_normalization_4/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="47172" shape="128, 64, 3, 3" size="147456"/>
			<output>
				<port id="0" names="conv2d_4/kernel:0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv2d_4" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="data_add_1032210327" type="Const" version="opset1">
			<data element_type="f16" offset="194628" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="batch_normalization_4/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_norm_output_buffer7" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="leaky_re_lu_4/weights1495320976" type="Const" version="opset1">
			<data element_type="f32" offset="896" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="leaky_re_lu_4" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/leaky_re_lu_4/LeakyRelu:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model_1/leaky_re_lu_4/LeakyRelu:0_pooling" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="ceil" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/leaky_re_lu_4/LeakyRelu:0_pooling0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="batch_normalization_5/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="194884" shape="256, 128, 3, 3" size="589824"/>
			<output>
				<port id="0" names="conv2d_5/kernel:0" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv2d_5" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="data_add_1033010335" type="Const" version="opset1">
			<data element_type="f16" offset="784708" shape="1, 256, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="batch_normalization_5/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_norm_output_buffer6" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="leaky_re_lu_5/weights1494921057" type="Const" version="opset1">
			<data element_type="f32" offset="896" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="leaky_re_lu_5" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/leaky_re_lu_5/LeakyRelu:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="model_1/leaky_re_lu_5/LeakyRelu:0_pooling" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="ceil" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/leaky_re_lu_5/LeakyRelu:0_pooling0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="batch_normalization_6/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="785220" shape="512, 256, 3, 3" size="2359296"/>
			<output>
				<port id="0" names="conv2d_6/kernel:0" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="conv2d_6" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="data_add_1033810343" type="Const" version="opset1">
			<data element_type="f16" offset="3144516" shape="1, 512, 1, 1" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="batch_normalization_6/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_norm_output_buffer5" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="leaky_re_lu_6/weights1496921018" type="Const" version="opset1">
			<data element_type="f32" offset="896" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="leaky_re_lu_6" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/leaky_re_lu_6/LeakyRelu:0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model_1/leaky_re_lu_6/LeakyRelu:0_pooling" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="2, 2" pads_begin="0, 0" pads_end="1, 1" rounding_type="ceil" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/leaky_re_lu_6/LeakyRelu:0_pooling0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="batch_normalization_7/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="3145540" shape="1024, 512, 3, 3" size="9437184"/>
			<output>
				<port id="0" names="conv2d_7/kernel:0" precision="FP16">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="conv2d_7" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="data_add_1034610351" type="Const" version="opset1">
			<data element_type="f16" offset="12582724" shape="1, 1024, 1, 1" size="2048"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="batch_normalization_7/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_norm_output_buffer4" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="leaky_re_lu_7/weights1495720889" type="Const" version="opset1">
			<data element_type="f32" offset="896" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="leaky_re_lu_7" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/leaky_re_lu_7/LeakyRelu:0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="batch_normalization_8/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="12584772" shape="256, 1024, 1, 1" size="524288"/>
			<output>
				<port id="0" names="conv2d_8/kernel:0" precision="FP16">
					<dim>256</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="conv2d_8" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="data_add_1035410359" type="Const" version="opset1">
			<data element_type="f16" offset="13109060" shape="1, 256, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="batch_normalization_8/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_norm_output_buffer3" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="leaky_re_lu_8/weights1496121093" type="Const" version="opset1">
			<data element_type="f32" offset="896" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="leaky_re_lu_8" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/leaky_re_lu_8/LeakyRelu:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="batch_normalization_9/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="13109572" shape="512, 256, 3, 3" size="2359296"/>
			<output>
				<port id="0" names="conv2d_9/kernel:0" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="conv2d_9" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="data_add_1036210367" type="Const" version="opset1">
			<data element_type="f16" offset="15468868" shape="1, 512, 1, 1" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="batch_normalization_9/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_norm_output_buffer1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="leaky_re_lu_9/weights1496520739" type="Const" version="opset1">
			<data element_type="f32" offset="896" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="leaky_re_lu_9" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/leaky_re_lu_9/LeakyRelu:0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="conv2d_10/kernel:0" type="Const" version="opset1">
			<data element_type="f16" offset="15469892" shape="255, 512, 1, 1" size="261120"/>
			<output>
				<port id="0" names="conv2d_10/kernel:0" precision="FP16">
					<dim>255</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv2d_10/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>255</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>255</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="conv2d_10/Dims5555" type="Const" version="opset1">
			<data element_type="f16" offset="15731012" shape="1, 255, 1, 1" size="510"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>255</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv2d_10" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>255</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>255</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="convolution_output1" precision="FP16">
					<dim>1</dim>
					<dim>255</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="558" type="Const" version="opset1">
			<data element_type="i64" offset="15731522" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Transpose4" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>255</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="TFNodes/model_1/conv2d_10/BiasAdd:0,transpose_output1" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>255</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__127/Unsqueeze" type="Const" version="opset1">
			<data element_type="i32" offset="15731554" shape="1" size="4"/>
			<output>
				<port id="0" names="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__127:0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="TFNodes/yolo_evaluation_layer_1/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>255</dim>
				</port>
			</input>
			<output>
				<port id="1" names="TFNodes/yolo_evaluation_layer_1/Shape_1:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="TFNodes/yolo_evaluation_layer_1/Shape_1__108" type="Convert" version="opset1">
			<data destination_type="i32"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" names="TFNodes/yolo_evaluation_layer_1/Shape_1__108:0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="TFNodes/yolo_evaluation_layer_1/strided_slice_1/Concat601120877" type="Const" version="opset1">
			<data element_type="i64" offset="15731558" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="TFNodes/yolo_evaluation_layer_1/strided_slice_1/Concat6001601221114" type="Const" version="opset1">
			<data element_type="i64" offset="15731566" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="TFNodes/yolo_evaluation_layer_1/strided_slice_1/Strides601320946" type="Const" version="opset1">
			<data element_type="i64" offset="15731558" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="TFNodes/yolo_evaluation_layer_1/strided_slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="TFNodes/yolo_evaluation_layer_1/strided_slice_1:0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="TFNodes/yolo_evaluation_layer_1/strided_slice_6/Concat619121396" type="Const" version="opset1">
			<data element_type="i64" offset="15731574" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="TFNodes/yolo_evaluation_layer_1/strided_slice_6/Concat6181619221273" type="Const" version="opset1">
			<data element_type="i64" offset="15731558" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="TFNodes/yolo_evaluation_layer_1/strided_slice_6/Strides619321420" type="Const" version="opset1">
			<data element_type="i64" offset="15731558" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="TFNodes/yolo_evaluation_layer_1/strided_slice_6" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="TFNodes/yolo_evaluation_layer_1/strided_slice_6:0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="TFNodes/yolo_evaluation_layer_1/strided_slice_6__126/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="15731574" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="TFNodes/yolo_evaluation_layer_1/strided_slice_6__126" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="TFNodes/yolo_evaluation_layer_1/strided_slice_6__126:0" precision="I32"/>
			</output>
		</layer>
		<layer id="81" name="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__128/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="15731574" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__128/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__128:0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="TFNodes/yolo_evaluation_layer_1/strided_slice_7/Concat622720859" type="Const" version="opset1">
			<data element_type="i64" offset="15731558" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="TFNodes/yolo_evaluation_layer_1/strided_slice_7/Concat6217622821009" type="Const" version="opset1">
			<data element_type="i64" offset="15731582" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="TFNodes/yolo_evaluation_layer_1/strided_slice_7/Strides622920742" type="Const" version="opset1">
			<data element_type="i64" offset="15731558" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="TFNodes/yolo_evaluation_layer_1/strided_slice_7" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="TFNodes/yolo_evaluation_layer_1/strided_slice_7:0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="TFNodes/yolo_evaluation_layer_1/strided_slice_7__121/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="15731574" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="TFNodes/yolo_evaluation_layer_1/strided_slice_7__121" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="TFNodes/yolo_evaluation_layer_1/strided_slice_7__121:0" precision="I32"/>
			</output>
		</layer>
		<layer id="89" name="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__129/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="15731574" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__129/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__129:0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__130/Unsqueeze" type="Const" version="opset1">
			<data element_type="i32" offset="15731590" shape="1" size="4"/>
			<output>
				<port id="0" names="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__130:0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__131/Unsqueeze" type="Const" version="opset1">
			<data element_type="i32" offset="15731594" shape="1" size="4"/>
			<output>
				<port id="0" names="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__131:0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Concat__132" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
				<port id="4" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" names="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Concat__132:0" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="TFNodes/yolo_evaluation_layer_1/Reshape_3__200" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" names="TFNodes/yolo_evaluation_layer_1/Reshape_3__200:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="TFNodes/yolo_evaluation_layer_1/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>255</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="TFNodes/yolo_evaluation_layer_1/Reshape_3:0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>3</dim>
					<dim>85</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="786621042" type="Const" version="opset1">
			<data element_type="i64" offset="15731598" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="97" name="786821147" type="Const" version="opset1">
			<data element_type="i64" offset="15731606" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="TFNodes/yolo_evaluation_layer_1/strided_slice_8/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>3</dim>
					<dim>85</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" names="TFNodes/yolo_evaluation_layer_1/strided_slice_8:0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>3</dim>
					<dim>2</dim>
				</port>
				<port id="4" names="TFNodes/yolo_evaluation_layer_1/strided_slice_10:0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>3</dim>
					<dim>2</dim>
				</port>
				<port id="5" names="TFNodes/yolo_evaluation_layer_1/strided_slice_12:0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
				<port id="6" names="TFNodes/yolo_evaluation_layer_1/strided_slice_13:0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>3</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="TFNodes/yolo_evaluation_layer_1/Sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" names="TFNodes/yolo_evaluation_layer_1/Sigmoid:0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="TFNodes/yolo_evaluation_layer_1/strided_slice_4/Concat611921246" type="Const" version="opset1">
			<data element_type="i64" offset="15731558" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="TFNodes/yolo_evaluation_layer_1/strided_slice_4/Concat6109612021228" type="Const" version="opset1">
			<data element_type="i64" offset="15731582" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="TFNodes/yolo_evaluation_layer_1/strided_slice_4/Strides612120841" type="Const" version="opset1">
			<data element_type="i64" offset="15731558" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="TFNodes/yolo_evaluation_layer_1/strided_slice_4" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="TFNodes/yolo_evaluation_layer_1/strided_slice_4:0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="TFNodes/yolo_evaluation_layer_1/strided_slice_4__147/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="15731574" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="TFNodes/yolo_evaluation_layer_1/strided_slice_4__147" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="TFNodes/yolo_evaluation_layer_1/strided_slice_4__147:0" precision="I32"/>
			</output>
		</layer>
		<layer id="106" name="TFNodes/yolo_evaluation_layer_1/arange_1/start:0" type="Const" version="opset1">
			<data element_type="i32" offset="15731638" shape="" size="4"/>
			<output>
				<port id="0" names="TFNodes/yolo_evaluation_layer_1/arange_1/start:0" precision="I32"/>
			</output>
		</layer>
		<layer id="107" name="TFNodes/yolo_evaluation_layer_1/arange_1__148_diff__149" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I32"/>
			</input>
			<output>
				<port id="2" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_diff__149:0" precision="I32"/>
			</output>
		</layer>
		<layer id="108" name="TFNodes/yolo_evaluation_layer_1/arange_1__148_cast_diff" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0" precision="I32"/>
			</input>
			<output>
				<port id="1" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_cast_diff:0" precision="FP16"/>
			</output>
		</layer>
		<layer id="109" name="TFNodes/yolo_evaluation_layer_1/arange_1__148_cast_delta" type="Const" version="opset1">
			<data element_type="f16" offset="15731642" shape="" size="2"/>
			<output>
				<port id="0" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_cast_delta:0" precision="FP16"/>
			</output>
		</layer>
		<layer id="110" name="TFNodes/yolo_evaluation_layer_1/arange_1__148_div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<input>
				<port id="0" precision="FP16"/>
				<port id="1" precision="FP16"/>
			</input>
			<output>
				<port id="2" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_div:0" precision="FP16"/>
			</output>
		</layer>
		<layer id="111" name="TFNodes/yolo_evaluation_layer_1/arange_1__148_ceil" type="Ceiling" version="opset1">
			<input>
				<port id="0" precision="FP16"/>
			</input>
			<output>
				<port id="1" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_ceil:0" precision="FP16"/>
			</output>
		</layer>
		<layer id="112" name="TFNodes/yolo_evaluation_layer_1/arange_1__148_trip_cnt" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="FP16"/>
			</input>
			<output>
				<port id="1" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_trip_cnt:0" precision="I64"/>
			</output>
		</layer>
		<layer id="113" name="TFNodes/yolo_evaluation_layer_1/arange_1__148_cond" type="Const" version="opset1">
			<data element_type="boolean" offset="15731644" shape="" size="1"/>
			<output>
				<port id="0" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_cond" precision="BOOL"/>
			</output>
		</layer>
		<layer id="114" name="TFNodes/yolo_evaluation_layer_1/arange_1/start:020979" type="Const" version="opset1">
			<data element_type="i32" offset="15731638" shape="" size="4"/>
			<output>
				<port id="0" names="TFNodes/yolo_evaluation_layer_1/arange_1/start:0" precision="I32"/>
			</output>
		</layer>
		<layer id="115" name="TFNodes/yolo_evaluation_layer_1/arange_1__148_loop" type="Loop" version="opset5">
			<port_map>
				<input external_port_id="1" internal_layer_id="1"/>
				<input external_port_id="2" internal_layer_id="0"/>
				<output axis="0" end="-1" external_port_id="3" internal_layer_id="4" part_size="1" start="0" stride="1"/>
				<output external_port_id="-1" internal_layer_id="8" purpose="execution_condition"/>
			</port_map>
			<back_edges>
				<edge from-layer="8" to-layer="1"/>
				<edge from-layer="7" to-layer="0"/>
			</back_edges>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="BOOL"/>
				<port id="2" precision="I32"/>
			</input>
			<output>
				<port id="3" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_loop:1" precision="I32">
					<dim>13</dim>
				</port>
			</output>
			<body>
				<layers>
					<layer id="0" name="prev" type="Parameter" version="opset1">
						<data element_type="i32" shape=""/>
						<output>
							<port id="0" names="prev" precision="I32"/>
						</output>
					</layer>
					<layer id="1" name="cond" type="Parameter" version="opset1">
						<data element_type="boolean" shape=""/>
						<output>
							<port id="0" names="cond" precision="BOOL"/>
						</output>
					</layer>
					<layer id="2" name="11_input_port_1/value" type="Const" version="opset1">
						<data element_type="i64" offset="15731574" shape="1" size="8"/>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="11" type="Unsqueeze" version="opset1">
						<input>
							<port id="0" precision="I32"/>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="Identity__155/sink_port_0" type="Result" version="opset1">
						<input>
