<?xml version="1.0" ?>
<net name="semantic_model" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 100, 100, 3"/>
			<output>
				<port id="0" names="input_1" precision="FP16">
					<dim>1</dim>
					<dim>100</dim>
					<dim>100</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="56" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/model_3/conv2d_1/BiasAdd__6" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>100</dim>
					<dim>100</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_3/conv2d_1/BiasAdd__6:0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/model_3/conv2d_1/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" offset="32" shape="32, 3, 3, 3" size="1728"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_3/conv2d_1/Conv2D/ReadVariableOp:0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/model_3/conv2d_1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/model_3/conv2d_1/BiasAdd/Dims591" type="Const" version="opset1">
			<data element_type="f16" offset="1760" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/model_3/conv2d_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_3/conv2d_1/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/model_3/conv2d_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model_3/conv2d_1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/model_3/conv2d_2/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" offset="1824" shape="32, 32, 3, 3" size="18432"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_3/conv2d_2/Conv2D/ReadVariableOp:0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/model_3/conv2d_2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/model_3/conv2d_2/BiasAdd/Dims621" type="Const" version="opset1">
			<data element_type="f16" offset="20256" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/model_3/conv2d_2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_3/conv2d_2/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/model_3/conv2d_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model_3/conv2d_2/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/model_3/max_pooling2d_1/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model_3/max_pooling2d_1/MaxPool:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/model_3/conv2d_3/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" offset="20320" shape="64, 32, 3, 3" size="36864"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_3/conv2d_3/Conv2D/ReadVariableOp:0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/model_3/conv2d_3/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/model_3/conv2d_3/BiasAdd/Dims603" type="Const" version="opset1">
			<data element_type="f16" offset="57184" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/model_3/conv2d_3/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_3/conv2d_3/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/model_3/conv2d_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model_3/conv2d_3/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/model_3/conv2d_4/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" offset="57312" shape="64, 64, 3, 3" size="73728"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_3/conv2d_4/Conv2D/ReadVariableOp:0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/model_3/conv2d_4/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/model_3/conv2d_4/BiasAdd/Dims597" type="Const" version="opset1">
			<data element_type="f16" offset="131040" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/model_3/conv2d_4/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_3/conv2d_4/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/model_3/conv2d_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model_3/conv2d_4/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Shape__32" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Shape__32:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Slice__34/Concat6892729" type="Const" version="opset1">
			<data element_type="i64" offset="131168" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Slice__34/Concat6796902732" type="Const" version="opset1">
			<data element_type="i64" offset="131176" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Slice__34/Strides6912750" type="Const" version="opset1">
			<data element_type="i64" offset="131184" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Slice__34" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="Slice__34:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="const_fold_opt__78" type="Const" version="opset1">
			<data element_type="i64" offset="131192" shape="2" size="16"/>
			<output>
				<port id="0" names="const_fold_opt__78" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Concat__36" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Concat__36:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Resize__37/StridedSlice_sizes_input_port_1/value4452735" type="Const" version="opset1">
			<data element_type="i64" offset="131176" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Resize__37/StridedSlice_sizes_input_port_2/value4472690" type="Const" version="opset1">
			<data element_type="i64" offset="131208" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Resize__37/StridedSlice_sizes_input_port_3/value4492756" type="Const" version="opset1">
			<data element_type="i64" offset="131184" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Resize__37/StridedSlice_sizes" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="465" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Resize__37/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="464" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Resize__37/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Resize__37/Add_input_port_1/value4632747" type="Const" version="opset1">
			<data element_type="f32" offset="131216" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Resize__37/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Resize__37/StridedSlice_scales_input_port_1/value4522720" type="Const" version="opset1">
			<data element_type="i64" offset="131176" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Resize__37/StridedSlice_scales_input_port_2/value4542768" type="Const" version="opset1">
			<data element_type="i64" offset="131208" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Resize__37/StridedSlice_scales_input_port_3/value4562774" type="Const" version="opset1">
			<data element_type="i64" offset="131184" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Resize__37/StridedSlice_scales" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Resize__37/axis4592717" type="Const" version="opset1">
			<data element_type="i64" offset="131220" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Resize__37" type="Interpolate" version="opset4">
			<data antialias="false" coordinate_transformation_mode="half_pixel" cube_coeff="-0.75" mode="nearest" nearest_mode="round_prefer_ceil" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" shape_calculation_mode="sizes"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" names="Resize__37:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/model_3/concatenate_1/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_3/concatenate_1/concat:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/model_3/conv2d_5/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" offset="131236" shape="32, 96, 3, 3" size="55296"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_3/conv2d_5/Conv2D/ReadVariableOp:0" precision="FP16">
					<dim>32</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/model_3/conv2d_5/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/model_3/conv2d_5/BiasAdd/Dims609" type="Const" version="opset1">
			<data element_type="f16" offset="186532" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/model_3/conv2d_5/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_3/conv2d_5/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/model_3/conv2d_5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model_3/conv2d_5/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/model_3/conv2d_6/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" offset="186596" shape="32, 32, 3, 3" size="18432"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_3/conv2d_6/Conv2D/ReadVariableOp:0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/model_3/conv2d_6/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/model_3/conv2d_6/BiasAdd/Dims585" type="Const" version="opset1">
			<data element_type="f16" offset="205028" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/model_3/conv2d_6/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_3/conv2d_6/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/model_3/conv2d_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model_3/conv2d_6/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/model_3/conv2d_7/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" offset="205092" shape="13, 32, 1, 1" size="832"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_3/conv2d_7/Conv2D/ReadVariableOp:0" precision="FP16">
					<dim>13</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/model_3/conv2d_7/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>13</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/model_3/conv2d_7/BiasAdd/Dims615" type="Const" version="opset1">
			<data element_type="f16" offset="205924" shape="1, 13, 1, 1" size="26"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/model_3/conv2d_7/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_3/conv2d_7/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="55" type="Const" version="opset1">
			<data element_type="i64" offset="205950" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Transpose__71" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transpose__71:0" precision="FP16">
					<dim>1</dim>
					<dim>100</dim>
					<dim>100</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Shape__73" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Shape__73:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Const__75" type="Const" version="opset1">
			<data element_type="i32" offset="205982" shape="4" size="16"/>
			<output>
				<port id="0" names="Const__75" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Gather__76/axis" type="Const" version="opset1">
			<data element_type="i64" offset="131168" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="67" name="Gather__7664" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="StatefulPartitionedCall/model_3/reshape_1/Shape:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/model_3/reshape_1/Shape__51" type="Convert" version="opset1">
			<data destination_type="i32"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model_3/reshape_1/Shape__51:0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/model_3/reshape_1/strided_slice/Concat7252762" type="Const" version="opset1">
			<data element_type="i64" offset="131168" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/model_3/reshape_1/strided_slice/Concat7157262687" type="Const" version="opset1">
			<data element_type="i64" offset="131184" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/model_3/reshape_1/strided_slice/Strides7272723" type="Const" version="opset1">
			<data element_type="i64" offset="131184" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/model_3/reshape_1/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="StatefulPartitionedCall/model_3/reshape_1/strided_slice:0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="const_fold_opt__77" type="Const" version="opset1">
			<data element_type="i32" offset="205998" shape="1" size="4"/>
			<output>
				<port id="0" names="const_fold_opt__77" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="const_fold_opt__79" type="Const" version="opset1">
			<data element_type="i32" offset="206002" shape="1" size="4"/>
			<output>
				<port id="0" names="const_fold_opt__79" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/model_3/reshape_1/Reshape/shape_Concat__63" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" names="StatefulPartitionedCall/model_3/reshape_1/Reshape/shape_Concat__63:0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/model_3/reshape_1/Reshape__64" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model_3/reshape_1/Reshape__64:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/model_3/reshape_1/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>100</dim>
					<dim>100</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_3/reshape_1/Reshape:0" precision="FP16">
					<dim>1</dim>
					<dim>10000</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/model_3/activation_1/Softmax/FlattenONNX_/Reshape/shape" type="Const" version="opset1">
			<data element_type="i64" offset="206006" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/model_3/activation_1/Softmax/FlattenONNX_/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>10000</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>130000</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/model_3/activation_1/Softmax/Softmax_" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>130000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>130000</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/model_3/activation_1/Softmax/ShapeOf_" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>10000</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="activation_1" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>130000</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="activation_1" precision="FP16">
					<dim>1</dim>
					<dim>10000</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="activation_1/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>10000</dim>
					<dim>13</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="9" to-port="0"/>
		<edge from-layer="8" from-port="0" to-layer="9" to-port="1"/>
		<edge from-layer="9" from-port="2" to-layer="11" to-port="0"/>
		<edge from-layer="10" from-port="0" to-layer="11" to-port="1"/>
		<edge from-layer="11" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="47" to-port="1"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="14" from-port="0" to-layer="15" to-port="1"/>
		<edge from-layer="15" from-port="2" to-layer="17" to-port="0"/>
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1"/>
		<edge from-layer="17" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="0" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="21" from-port="0" to-layer="22" to-port="1"/>
		<edge from-layer="22" from-port="2" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="36" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="46" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="28" to-port="0"/>
		<edge from-layer="25" from-port="0" to-layer="28" to-port="1"/>
		<edge from-layer="26" from-port="0" to-layer="28" to-port="2"/>
		<edge from-layer="27" from-port="0" to-layer="28" to-port="3"/>
		<edge from-layer="28" from-port="4" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="0" to-layer="30" to-port="1"/>
		<edge from-layer="30" from-port="2" to-layer="34" to-port="0"/>
		<edge from-layer="30" from-port="2" to-layer="35" to-port="0"/>
		<edge from-layer="31" from-port="0" to-layer="34" to-port="1"/>
		<edge from-layer="32" from-port="0" to-layer="34" to-port="2"/>
		<edge from-layer="33" from-port="0" to-layer="34" to-port="3"/>
		<edge from-layer="34" from-port="4" to-layer="46" to-port="1"/>
		<edge from-layer="35" from-port="1" to-layer="38" to-port="0"/>
		<edge from-layer="36" from-port="1" to-layer="37" to-port="0"/>
		<edge from-layer="37" from-port="1" to-layer="38" to-port="1"/>
		<edge from-layer="38" from-port="2" to-layer="40" to-port="0"/>
		<edge from-layer="39" from-port="0" to-layer="40" to-port="1"/>
		<edge from-layer="40" from-port="2" to-layer="44" to-port="0"/>
		<edge from-layer="41" from-port="0" to-layer="44" to-port="1"/>
		<edge from-layer="42" from-port="0" to-layer="44" to-port="2"/>
		<edge from-layer="43" from-port="0" to-layer="44" to-port="3"/>
		<edge from-layer="44" from-port="4" to-layer="46" to-port="2"/>
		<edge from-layer="45" from-port="0" to-layer="46" to-port="3"/>
		<edge from-layer="46" from-port="4" to-layer="47" to-port="0"/>
		<edge from-layer="47" from-port="2" to-layer="49" to-port="0"/>
		<edge from-layer="48" from-port="0" to-layer="49" to-port="1"/>
		<edge from-layer="49" from-port="2" to-layer="51" to-port="0"/>
		<edge from-layer="50" from-port="0" to-layer="51" to-port="1"/>
		<edge from-layer="51" from-port="2" to-layer="52" to-port="0"/>
		<edge from-layer="52" from-port="1" to-layer="54" to-port="0"/>
		<edge from-layer="53" from-port="0" to-layer="54" to-port="1"/>
		<edge from-layer="54" from-port="2" to-layer="56" to-port="0"/>
		<edge from-layer="55" from-port="0" to-layer="56" to-port="1"/>
		<edge from-layer="56" from-port="2" to-layer="57" to-port="0"/>
		<edge from-layer="57" from-port="1" to-layer="59" to-port="0"/>
		<edge from-layer="58" from-port="0" to-layer="59" to-port="1"/>
		<edge from-layer="59" from-port="2" to-layer="61" to-port="0"/>
		<edge from-layer="60" from-port="0" to-layer="61" to-port="1"/>
		<edge from-layer="61" from-port="2" to-layer="63" to-port="0"/>
		<edge from-layer="61" from-port="2" to-layer="64" to-port="0"/>
		<edge from-layer="62" from-port="0" to-layer="63" to-port="1"/>
		<edge from-layer="63" from-port="2" to-layer="77" to-port="0"/>
		<edge from-layer="64" from-port="1" to-layer="67" to-port="0"/>
		<edge from-layer="65" from-port="0" to-layer="67" to-port="1"/>
		<edge from-layer="66" from-port="0" to-layer="67" to-port="2"/>
		<edge from-layer="67" from-port="3" to-layer="68" to-port="0"/>
		<edge from-layer="68" from-port="1" to-layer="72" to-port="0"/>
		<edge from-layer="69" from-port="0" to-layer="72" to-port="1"/>
		<edge from-layer="70" from-port="0" to-layer="72" to-port="2"/>
		<edge from-layer="71" from-port="0" to-layer="72" to-port="3"/>
		<edge from-layer="72" from-port="4" to-layer="75" to-port="0"/>
		<edge from-layer="73" from-port="0" to-layer="75" to-port="1"/>
		<edge from-layer="74" from-port="0" to-layer="75" to-port="2"/>
		<edge from-layer="75" from-port="3" to-layer="76" to-port="0"/>
		<edge from-layer="76" from-port="1" to-layer="77" to-port="1"/>
		<edge from-layer="77" from-port="2" to-layer="79" to-port="0"/>
		<edge from-layer="77" from-port="2" to-layer="81" to-port="0"/>
		<edge from-layer="78" from-port="0" to-layer="79" to-port="1"/>
		<edge from-layer="79" from-port="2" to-layer="80" to-port="0"/>
		<edge from-layer="80" from-port="1" to-layer="82" to-port="0"/>
		<edge from-layer="81" from-port="1" to-layer="82" to-port="1"/>
		<edge from-layer="82" from-port="2" to-layer="83" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2021.4.2-3974-e2a469a3450-releases/2021/4"/>
		<cli_parameters>
			<batch value="1"/>
			<caffe_parser_path value="DIR"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
			<input value="input_1"/>
			<input_model value="DIR/semantic_model.onnx"/>
			<input_model_is_text value="False"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<keep_shape_ops value="True"/>
			<legacy_ir_generation value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="semantic_model"/>
			<output value="['activation_1']"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="{'input_1': None}"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<transform value=""/>
			<unset unset_cli_parameters="counts, disable_fusing, disable_gfusing, finegrain_fusing, input_checkpoint, input_meta_graph, input_proto, input_shape, input_symbol, mean_file, mean_file_offsets, move_to_preprocess, nd_prefix_name, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
